BACKEND/tests/load/login.yml
config:
  target: "http://localhost:8500"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Warm up (Rampa suave)"
    - duration: 60
      arrivalRate: 20
      name: "Sustained peak load (Carga alta contínua)"
  payload:
    # Apenas um dummy payload file, normalmente você pode rotacionar dezenas de e-mails em um CSV aqui
    path: "./users.csv"
    fields:
      - "email"
      - "password"
      - "tenantSlug"

scenarios:
  - name: "Authentication Spike (Post Login request)"
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            tenantSlug: "{{ tenantSlug }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"